leetcode_239_sliding_window_maximum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 239. Sliding Window Maximum</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 239. Sliding Window Maximum</h1>
<p>
<a href="https://leetcode.com/problems/sliding-window-maximum/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="pattern_find_optimal_values_for_every_subarray_of_specific_size.html#ID-07D31904-E85B-4566-A2CD-9013AAA800C0">Pattern: Find optimal values for every subarray of specific size</a>.  This problem is similar to <a href="sliding_window.html#ID-798B6359-F1A6-4B42-BBA1-2120D8CD228B">Sliding Window Maximum</a>.  Time and space complexity are \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> deque


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maxSlidingWindow</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], k: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        q = deque()
        <span style="font-weight: bold; font-style: italic;">ans</span> = []
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(nums)):
            <span style="font-weight: bold;">while</span> q <span style="font-weight: bold;">and</span> i - q[0] &gt;= k:
                q.popleft()
            <span style="font-weight: bold;">while</span> q <span style="font-weight: bold;">and</span> nums[q[-1]] &lt;= nums[i]:
                q.pop()
            q.append(i)
            <span style="font-weight: bold;">if</span> i + 1 &gt;= k:
                ans.append(nums[q[0]])
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().maxSlidingWindow([1, 3, -1, -3, 5, 3, 6, 7], 3) == [3, 3, 5, 5, 6, 7]
<span style="font-weight: bold;">assert</span> Solution().maxSlidingWindow([1], 1) == [1]
</pre>
</div>
</div>
</body>
</html>